import { RecycleTipsType } from "@/interface/Recycle";

export const recycleTips: RecycleTipsType = {
  containers: [
    "紙容器要先倒空、沖洗，再回收！",
    "記得把吸管、塑膠蓋分開，紙杯才能回收！",
    "飲料盒要壓扁，省空間也方便運送！",
    "紙容器，回收後也能繼續循環！",
    "紙容器不只是垃圾，它能再變成新資源！"
  ],

  cans: [
    "一個鐵鋁罐回收後，可以省下許多能源！",
    "你的罐子可能會變成腳踏車或新的飲料罐！",
    "別小看鐵鋁罐，它可是循環利用的好資源！",
    "回收罐子，讓金屬重新發光！",
    "謝謝你，讓這個罐子有第二次生命！"
  ],

  bottles: [
    "寶特瓶要先倒空、沖洗、壓扁再回收！",
    "記得把瓶蓋和瓶標拆下來，和瓶身分開回收！",
    "乾淨的寶特瓶，才有機會變成新寶特瓶！",
    "沖洗一下，寶特瓶就能重獲新生！",
    "瓶蓋、瓶標、瓶身分開，回收更有效率！"
  ],

  paper: [
    "有油污或髒污的紙不能回收喔！",
    "紙箱要壓扁、拆膠帶，才能更有效率回收！",
    "小小一張紙，回收後也能延續它的故事！",
    "記得把紙張保持乾燥再回收，要不然會影響呦！",
    "回收的紙，可能會變成新的書本或衛生紙！"
  ],

  plastic: [
    "塑膠雖小，影響不小，謝謝你用心回收！",
    "下次外帶時，可以試試自備餐盒喔！",
    "你的每一次回收，都是給地球的禮物！",
    "塑膠需要很久才分解，回收是最好的選擇！",
    "感謝你替海洋少留下一片塑膠！"
  ]
};
